app/views/movies/index.html.erb

              <ul>
                <% tag_cloud Movie.tag_counts.order(:name), %w{s m l} do |tag, css_class| %>
---
SELECT COUNT(*) FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN movies ON movies.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Movie' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT movies.id FROM "movies")) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN movies ON movies.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Movie' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT movies.id FROM "movies")) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id  ORDER BY "tags"."name" ASC

          <h2><%= movie.title %></h2>
          <p><%= raw movie.tag_list.map { |t| link_to t, tag_path(t) }.join(', ') %></p>
---
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN movies ON movies.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Movie' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT movies.id FROM "movies")) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id  ORDER BY ASC