app/controllers/comments_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("name", "body", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "pras"], ["body", "awesome"], ["movie_id", 2], ["created_at", "2015-09-09 06:58:26.494582"], ["updated_at", "2015-09-09 06:58:26.494582"]]
---
  def create
    @movie = Movie.find(params[:movie_id])
    @comment = @movie.comments.build(comment_params)

    if @comment.save