app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" JOIN taggings movies_taggings_db56e2e  ON movies_taggings_db56e2e.taggable_id = movies.id AND movies_taggings_db56e2e.taggable_type = 'Movie' AND movies_taggings_db56e2e.tag_id = 6
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN movies ON movies.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Movie' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT movies.id FROM "movies")) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id  ORDER BY ASC
---
  def index
    if params[:tag]
      @movies = Movie.tagged_with(params[:tag])
    else
      @movies = Movie.all

INSERT INTO "movies" ("title", "description", "director", "stars", "cover_file_name", "cover_content_type", "cover_file_size", "cover_updated_at", "release", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "cover_updated_at" = ?, "cover_file_name" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["cover_updated_at", "2015-09-09 02:20:31.681296"], ["cover_file_name", "visit.jpg"], ["updated_at", "2015-09-09 02:20:32.477308"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)